
<!-- saved from url=(0051)https://gyires.inf.unideb.hu/KMITT/c09/ch01s02.html -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
      
   <title>1.2. A Windows termékvonala</title><link rel="stylesheet" href="./1.2. A Windows termékvonala_files/style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html" title="A Windows Server 2008 R2 menedzselése"><link rel="up" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html" title="1. fejezet - Elméleti háttér"><link rel="prev" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html" title="1. fejezet - Elméleti háttér"><link rel="next" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s03.html" title="1.3. A Windows Server 2008 R2 és kiadásai"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.2. 
      A Windows termékvonala</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">1. fejezet - Elméleti háttér</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s03.html">Következ&#337;</a></td></tr></tbody></table><hr></div><div class="sect1" title="1.2. A Windows termékvonala"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e92"></a>1.2. 
      A Windows termékvonala</h2></div></div></div><p>A Microsoft Windows operációs rendszere alapvet&#337;en két f&#337; vonulatra osztható: mindvégig jól
            elkülöníthet&#337; az otthoni felhasználóknak, illetve a vállalati felhasználóknak szánt
            termékcsoport. Ennek szerepe még a Windows 95 operációs rendszer megjelenéséhez köthet&#337;.
            Az el&#337;z&#337; változat, a Windows 3.1 illetve Windows 3.11 még DOS-ból, és külön paranccsal
            indult. </p><div class="sect2" title="1.2.1. Korai változatok"><div class="titlepage"><div><div><h3 class="title"><a name="d0e97"></a>1.2.1. 
      Korai változatok</h3></div></div></div><p>A DOS-os programok jellemz&#337;en egyedül birtokolták a memóriát, a CPU-t, stb. (Természetesen az interrupt rendszer segítségével már valósultak meg „multitask”-os programok, de ez nem igazi multitask). El&#337;re nem tervezett esetekben ekkor el&#337;fordulhatott az is, hogy az alkalmazás nem adta vissza a CPU-t a DOS-nak, hanem kizárólagosan használta azt (akár a programozó hibájából). A Windows 3.1 után megjelen&#337; új Windows verziónál a Microsoft döntés elé került. Vagy készít egy olyan operációs rendszert, amely kizárja ezeket a hibákat (nem engedi futni a rosszul megírt alkalmazásokat) és egy stabil rendszer lesz, vagy hagyja a régi rendszert tovább élni. </p><p>Az els&#337; választás következményeként a felhasználók „jogosan” morogtak volna, hiszen azok a régi hibás alkalmazásaik, amik DOS alatt hibátlanul futottak, azok a Windows 95 alatt nem lettek volna m&#369;köd&#337;képesek. A következmény nyilvánvaló… </p><p>A másik választás esetében pedig készül egy új operációs rendszer, ami csak felületében és szolgáltatásaiban tér el a DOS-tól. </p><p>Természetesen ez kicsit sarkított vélemény, de a lényeget jól mutatja. Belátható, hogy végül is nem volt igazi alternatíva, hiszen a felhasználók az els&#337; esetben nem vásárolják meg otthonra az új Windows-t.</p><p>A gond azonban nem oldódott meg. Vállalati környezetben a felhasználók javarészt nem korábbi játékaikkal játszanak. A vállalat pedig el&#337;bb-utóbb a stabil operációs rendszer használatának érdekében korábbi, esetleg bizonytalan alkalmazásait újraírathatja. Ezért kettéválasztották a Windows termékvonalat. Az otthoni felhasználóknak készült a Windows 95, a Windows 98, a Windows 98 SE, a Windows Milennium. A vállalati felhasználóknak pedig a Windows NT 4.0, és a Windows 2000. </p></div><div class="sect2" title="1.2.2. Windows XP – Windows Server 2003"><div class="titlepage"><div><div><h3 class="title"><a name="d0e110"></a>1.2.2. 
      Windows XP – Windows Server 2003</h3></div></div></div><p>A Windows XP megjelenésekor a Microsoft egyesítette a két vonalat. Az otthoni felhasználók is megkapták a stabil operációs rendszer memória-, és task kezelését, ennek következtében néhány inkorrekt módon megírt alkalmazás az XP-n már nem fut. Az otthoni felhasználók szokásainak vizsgálatával a Microsoft kiválogatta azokat a szolgáltatásokat, amikre valószín&#369;leg nem lesz szükség. Ezeket a Windows XP egy másik változatába tette be. Így végül is az XP-b&#337;l két változat készült: a Home és a Professional változat. XP-b&#337;l azonban nem készült ún. kiszolgáló (server) változat. Ezt a Microsoft a Windows Server 2003-mal pótolta. Ezután a fejlesztés követhet&#337;bbé vált, hiszen minden Windows változat innent&#337;l kezdve ugyanazt az irányt követte, az operációs rendszer stabilizálását. Így már csak 1 kernel-t kellett fejleszteni, és az abban lev&#337; hibákat javítani.</p></div><div class="sect2" title="1.2.3. Windows Vista – Windows Server 2008"><div class="titlepage"><div><div><h3 class="title"><a name="d0e115"></a>1.2.3. 
      Windows Vista – Windows Server 2008</h3></div></div></div><p>Következ&#337; kliens a Windows Vista volt (2006. november 8.), aminek fejlesztésekor a Microsoft az addig érvényes trendeket követve (folyamatosan es&#337; memória árak, növekv&#337; memória méretek, gyorsabb processzorok, növekv&#337; merevlemez kapacitás) elkövette azt a hibát, hogy igen er&#337;forrás igényes lett. Els&#337;sorban memóriából igényelt sokat, f&#337;ként a grafikus felület felgyorsítása miatt. Utólag már látható, hogy a felhasználók (jellemz&#337;en a magas memória árak miatt) nem nagyon fejlesztették PC-s rendszerüket. Mivel a Windows XP is az évek múlásával egyre kedveltebb és stabilabb lett (a korábban s&#369;r&#369;bben el&#337;forduló úgynevezett „kék halál”-ról sok felhasználó már csak hallomásból tudott), nem volt igazán ok sem a Vistá-ra való áttérésre. Akik gyengébb PC-jükön mégis megpróbálkoztak vele, (hiszen a telepítés kevesebb memóriával rendelkez&#337; gépekre is lehetséges volt), azok rövidebb-hosszabb id&#337; elteltével többnyire megint Windows XP-t használtak, és Vistá-val kapcsolatos panaszaiknak hangot is adtak. Azt is fontos megemlíteni, hogy a Microsoft a korábbi biztonsági hiányosságok miatt úgy döntött, hogy minél teljesebb mértékben igyekszik a következ&#337; operációs rendszerét újraírni. Emiatt újabb programozói- és biztonsági hibák is bekerülhettek a kernel-be. Az itt megjelen&#337;, talán kicsit túl érzékeny biztonsági rendszert (a sok port kavart UAC – User Access Control) a felhasználók nehezen fogadták el, és több alkalmazás sem volt emiatt m&#369;köd&#337;képes.</p><p>Közel másfél évvel kés&#337;bb erre a kernel-re építve elkészült a szerver változat, a Windows Server 2008 (2008. február 27.). Az addig megtalált hibákat javították, és mivel egy szerver eleve több memóriával rendelkezik, ez a változat az üzemeltet&#337;k között sikeres lett.</p></div><div class="sect2" title="1.2.4. Windows 7- Windows Server 2008 R2"><div class="titlepage"><div><div><h3 class="title"><a name="d0e122"></a>1.2.4. 
      Windows 7- Windows Server 2008 R2</h3></div></div></div><p>A Vista hardverigényén csökkentve (a grafikus rendszer m&#369;ködésének alapjait átírva), újabb felülettel, újabb szolgáltatásokkal kib&#337;vítve elkészült a Windows 7 (2009. október 22.). A korábban hozzáférhet&#337;vé tett el&#337;zetes kiadásokat a szakújságírók tesztelték, és dicsérték. Emiatt a felhasználók is nagyon várták a végleges változatot. A piaci mutatók szerint a Windows 7 mostanra kedvelt, elterjedt operációs rendszer lett, pedig nincs lényeges változtatás a Vistá-hoz képest.</p><p>Ugyanebben az id&#337;ben (2009. október 22.) megjelent a frissített szerver változat is, a Windows Server 2008 R2. GUI-ja (Graphical User Interface – grafikus felhasználói felület) a Windows 7-é, szolgáltatásai jellemz&#337;en a Windows Server 2008-é.</p><p>A következ&#337; táblázatban összefoglalva láthatók a különböz&#337; (fontosabb) Windows változatok, kernel-jük verzió száma, és az úgynevezett kibocsátási alverzió (RTM – Release To Manufacturing). Itt megfigyelhet&#337;, hogy az egyes változatok valóban mennyire egymásra épülnek.</p><div class="table"><a name="d0e131"></a><p class="title"><b>1.1. táblázat - Windows verziók</b></p><div class="table-contents"><table summary="Windows verziók" style="border-collapse: collapse;border-top: 0.5pt solid ; border-bottom: 0.5pt solid ; border-left: 0.5pt solid ; border-right: 0.5pt solid ; "><colgroup><col><col><col></colgroup><thead><tr><th style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Név, verziók&nbsp;</th><th style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Kernel</th><th style="border-bottom: 0.5pt solid ; ">RTM</th></tr></thead><tbody><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Windows NT 4.0 Workstation, Server, Enterprise&nbsp;  Server</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">   NT 4.0 </td><td style="border-bottom: 0.5pt solid ; "> 1381</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Windows 2000 Professional, Server, Advanced Server</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">&nbsp; &nbsp;NT 5.0</td><td style="border-bottom: 0.5pt solid ; ">&nbsp;2195</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Windows XP&nbsp; &nbsp; &nbsp; &nbsp; Home, Professional&nbsp; &nbsp; </td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">&nbsp; &nbsp;NT 5.1</td><td style="border-bottom: 0.5pt solid ; ">&nbsp;2600</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Windows Server 2003 Web, Std, Adv., Enterp. Datacenter&nbsp;&nbsp; </td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">&nbsp; &nbsp;NT 5.2</td><td style="border-bottom: 0.5pt solid ; ">&nbsp;3790</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Windows Vista Starter, Home Basic, H-Premium, Enterprise </td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">&nbsp; &nbsp;NT 6.0</td><td style="border-bottom: 0.5pt solid ; ">&nbsp;6000</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Windows Server 2008 Web, Std, Enterprise, Datacenter</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">&nbsp; &nbsp;NT 6.0</td><td style="border-bottom: 0.5pt solid ; ">&nbsp;6001</td></tr><tr><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">Windows 7 Starter, Home Basic-Premium, Prof, Enterp, Ultim.</td><td style="border-right: 0.5pt solid ; border-bottom: 0.5pt solid ; ">&nbsp; &nbsp;NT 6.1</td><td style="border-bottom: 0.5pt solid ; ">&nbsp;7600</td></tr><tr><td style="border-right: 0.5pt solid ; ">Windows Server 2008 R2 Web, Std, Enterprise, Datacenter</td><td style="border-right: 0.5pt solid ; ">&nbsp; &nbsp;NT 6.1</td><td style="">&nbsp;7600</td></tr></tbody></table></div></div><br class="table-break"></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s03.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">1. fejezet - Elméleti háttér&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;1.3. 
      A Windows Server 2008 R2 és kiadásai</td></tr></tbody></table></div></body></html>