
<!-- saved from url=(0051)https://gyires.inf.unideb.hu/KMITT/c09/ch01s03.html -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
      
   <title>1.3. A Windows Server 2008 R2 és kiadásai</title><link rel="stylesheet" href="./1.3. A Windows Server 2008 R2 és kiadásai_files/style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html" title="A Windows Server 2008 R2 menedzselése"><link rel="up" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html" title="1. fejezet - Elméleti háttér"><link rel="prev" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s02.html" title="1.2. A Windows termékvonala"><link rel="next" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s04.html" title="1.4. Számítógépek, és logikai csoportok"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.3. 
      A Windows Server 2008 R2 és kiadásai</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s02.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">1. fejezet - Elméleti háttér</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s04.html">Következ&#337;</a></td></tr></tbody></table><hr></div><div class="sect1" title="1.3. A Windows Server 2008 R2 és kiadásai"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e200"></a>1.3. 
      A Windows Server 2008 R2 és kiadásai</h2></div></div></div><p>A kicsit hosszúra nyúlt változatok ismertetése után nézzük a Windows Server 2008 R2-t (W2K8R2) részletesebben. Telepítés el&#337;tt (tulajdonképpen már a vásárláskor) tudnunk kell, milyen változatok állnak rendelkezésre, és az egyes változatok miben különböznek egymástól.</p><p>Windows Server 2008 R2 Foundation: ez a legegyszer&#369;bb változat, több kötöttséggel. Legfeljebb 1 processzort képes kezelni, és maximum 8 GB-t memóriát. Bár ez még több cégnek elegend&#337; is lenne, de 15 f&#337;ben korlátozzák a felhasználók számát. Emiatt leginkább egy kis iroda m&#369;ködtetéséhez elegend&#337;. Képes tartományt kezelni, illetve már létez&#337; tartományba is beléptethet&#337; bizonyos korlátozásokkal.</p><p>Windows Web Server 2008 R2: egy meglehet&#337;sen érdekes kiadás. Bár nevéb&#337;l is adódóan els&#337;sorban Web (és alkalmazás) szerver futtatására tervezték, és ennek megfelel&#337;en korlátozások vannak benne, de ugyanakkor vannak olyan jellemz&#337;i, amelyekben ugyanazt tudja, mint a nagyobb (Standard) kiadás: maximum 4 db 64 bites processzor, legfeljebb 32 GB memória, 2 Remote Desktop Admin csatlakozási lehet&#337;ség. Tudja futtatni a Microsoft SQL szervert, és képes hálózati szolgáltatásokat is nyújtani (DNS – Domain Name System, integrálva tartalmazza az IIS 7.5 – Internet Information Services 7.5, az ASP.NET-et, a Microsoft .NET Framework-öt).</p><p>Windows Server 2008 R2 Standard: ez a legáltalánosabb verzió. F&#337;ként kiszolgálók operációs rendszereként használják, például SQL szerverhez. Támogatja a komolyabb hardver kiépítést: maximum 4 db 64 bites processzor, legfeljebb 32 GB memória. További jellemz&#337;i a Hyper-V alapú virtualizáció, az IIS 7.5, és a legfeljebb 250 egyidej&#369; hálózati kapcsolat. Képes hálózati szolgáltatások nyújtására (DNS, DHCP – Dynamic Host Configuration Protocol). Ugyanakkor nem támogatja a cluster-ezést, a DFS-R-t (cross-file replication), és az AD FS-t (Active Directory Federation Services). Javasolt felhasználási terület még a fájl szerver, a nyomtató szerver, a média szerver, és a SharePoint szerver.</p><p>Windows Server 2008 R2 Enterprise: mindent tud, amit a Standard Edition. Ahhoz képest azonban jelent&#337;s b&#337;vüléseket találhatunk: korlátlan számú hálózati kapcsolatok, maximum 2 TB memória, 8 db 64 bites processzor, 16 node-os cluster kialakítás. Ha a hardver is támogatja, b&#337;víthet&#337; m&#369;ködés közben a memória. Megfelel&#337; kliensek esetén a távoli irodák (fiók irodák - branch office) hatékonyságát növeli a hálózati forgalom csökkentésével (BranchCache).</p><p>Windows Server 2008 R2 Datacenter: gyakorlatilag nincsenek benne korlátozások. Hardvert&#337;l függ&#337;en m&#369;ködés közben akár processzorok is adhatók hozzá, illetve cserélhet&#337;k. Korlátlan számú virtuális image használati jog, korlátlan számú hálózati- és VPN kapcsolat, 64 db 64 bites processzor (4 magos processzorok esetében ez 256 logikai processzor).</p><p></p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s02.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s04.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">1.2. 
      A Windows termékvonala&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;1.4. 
      Számítógépek, és logikai csoportok</td></tr></tbody></table></div></body></html>