
<!-- saved from url=(0051)https://gyires.inf.unideb.hu/KMITT/c09/ch01s06.html -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
      
   <title>1.6. Az installálás lépései</title><link rel="stylesheet" href="./1.6. Az installálás lépései_files/style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html" title="A Windows Server 2008 R2 menedzselése"><link rel="up" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html" title="1. fejezet - Elméleti háttér"><link rel="prev" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s05.html" title="1.5. Az installálási el&#337;készületek"><link rel="next" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s07.html" title="1.7. Bejelentkezés, kijelentkezés, jelszómódosítás"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.6. 
     Az installálás lépései</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s05.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">1. fejezet - Elméleti háttér</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s07.html">Következ&#337;</a></td></tr></tbody></table><hr></div><div class="sect1" title="1.6. Az installálás lépései"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e316"></a>1.6. 
     Az installálás lépései</h2></div></div></div><p>Optikai meghajtóról történ&#337; telepítés során el&#337;ször célszer&#369; ellen&#337;rizni, szükség szerint módosítani a boot eszközök sorrendjét. Biztonsági okok miatt sok helyen eleve kiveszik az optikai meghajtót, illetve az egyéb küls&#337; eszközöket. A BIOS-ba való belépés számítógépenként eltér&#337; módon történhet, de sok esetben bekapcsolás után valamelyik funkció gomb (F) nyomva tartásával a szokásos. Itt kell megkeresni a boot menüt, majd ha szükséges volt a módosítás, akkor mentéssel kilépni, betenni a DVD-t a meghajtóba, és újra indítani a számítógépet.</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/000-install.jpg"> 
   
         </p><p>3. ábra. Boot eszközök sorrendjének megadása</p><p></p><p>Sikeres boot-oláskor meg kell adni, hogy milyen nyelven kívánjuk installálni az operációs rendszert, milyen régiós beállítást kérünk (dátum – id&#337;, pénz formátum miatt), majd hogy milyen billenty&#369;zet kiosztást kérünk. </p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/001-install.jpg"> 
   
         </p><p>4. ábra. Telepítési adatok kiválasztása</p><p></p><p>A Next gomb megnyomása után következ&#337; oldalon rögtön kezd&#337;dhet a telepítés folytatása (Install &#8594;), vagy két további lehet&#337;ség közül lehet választani (információk a telepítésr&#337;l – What to know…, illetve már telepített operációs rendszer javítása - Repair your computer).</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/002-install.jpg"> 
   
         </p><p>5. ábra. Telepítés megkezdése</p><p></p><p>Az Install gomb megnyomása után megjelen&#337; ablakban kell kiválasztani, hogy melyik változat kerüljön telepítésre (Standard, Enterprise, Datacenter, Web Server), illetve hogy grafikus felülettel (Full Installation), vagy anélkül (Server Core Installation). A 6. ábrán megfigyelhet&#337; az is, hogy csak 64 bites változat létezik.</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/003-install.jpg"> 
   
         </p><p>6. ábra. A server változat megadása</p><p></p><p>A megfelel&#337; változat kiválasztása, és a Next megnyomása után a licensz szerz&#337;dés szövege következik. Annak elfogadása, és Next után folytatódhat a további választás.</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/004-install.jpg"> 
   
         </p><p>7. ábra. A licensz szerz&#337;dés elfogadása</p><p></p><p>A következ&#337;s ablakban egy meglév&#337; Windows operációs rendszer frissítése (Upgrade), vagy új installálás (Clean Install – most Custom) között lehet választani. Jelen esetben a Custom megadása után ki kell választani a merevlemezt, és a particiót, ahova az installálás történik. </p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/005-install.jpg"> 
   
         </p><p>8. ábra. Telepítési mód (Custom) kiválasztása</p><p></p><p>Ezután lehet&#337;ség van új partíció létrehozására, meglév&#337;k törlésére, összevonására, szükség
            szerint formázására. Az installáló program azonban csak a legfontosabb lehet&#337;ségeket
            biztosítja, komoly szolgáltatásokat nem érdemes várni, hiszen a kifejezetten erre való
            programok ára sok esetben közelít egy kliens Windows operációs rendszer árához (pl.:
            2011 márciusában a Partition Magic forgalmazótól függ&#337;en kb. 20.000 Ft, míg egy Windows
            7 Home Premium OEM 27.000 Ft). (Érdekességképpen, 2005 augusztusában a Partition Magic
            kb. 21.000 Ft volt, míg a Windows XP Professional OEM 33.000 Ft). Természetesen léteznek
            ingyenes változatok is, több esetben Linux alapokon.</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/006-install.jpg"> 
   
         </p><p>9. ábra. Merevlemez és partíció kiválasztása</p><p></p><p>Ezután a 10. ábrának megfele&#337;en megkezd&#337;dik a szükséges fájlok tömörített változatának
            felmásolása (copying) a merevlemezre a DVD-r&#337;l, majd a felmásolt fájlok kitömörítése
            (expanding). Ehhez akár több GB átmeneti területre is szükség lehet a merevlemezen. A
            következ&#337; lépések automatikusan futnak le, nincs szükség felhasználói
            beavatkozásra.</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/008-install.jpg"> 
   
         </p><p>10. ábra. Másolás, kitömörítés</p><p></p><p>Kitömörítés után egy reboot-ot (11. ábra) követ&#337;en folytatódik az installálás. Amikor ez is befejez&#337;dik, megjelenik a bejelentkezési ablak (12. ábra).</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/009-install.jpg"> 
   
         </p><p>11. ábra. A számítógép újraindítása</p><p></p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/010-install.jpg"> 
   
         </p><p>12. ábra. Bejelentkezési képerny&#337;</p><p></p><p>Els&#337; sikeres bejelentkezés után a felhasználónak módosítania kell a jelszavát a 13. ábrának megfelel&#337;en.</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/011-install.jpg"> 
   
         </p><p>13. ábra. Jelszó módosítás</p><p></p><p>Módosítás után elkészül a felhasználó asztala (desktop), létrejönnek a szükséges fájlok, katalógusok (14. ábra).</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/012-install.jpg"> 
   
         </p><p>14. ábra. Az asztal létrehozása</p><p></p><p>Ezután elindul egy alkalmazás (Initial Configuration Tasks), amely lehet&#337;séget kezdeti beállítások elvégzésére (id&#337;zóna megadására, hálózat konfigurálására, számítógép nevének megadására, munkacsoportba, vagy tartományba történ&#337; belépésre, stb.). A 15. ábrán látható, hogy a frissen feltelepített Windows még nincs aktiválva (Not activated).</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/013-activate.jpg"> 
   
         </p><p>15. ábra. Kezdeti beállítások</p><p></p><p>Érdemes tisztázni az aktiválás fogalmát, szerepét. Telepítéskor ugyan meg kell adni az
            úgynevezett termékkulcsot, amivel igazoljuk, hogy rendelkezünk egy jogtiszta
            Windows-zal, de ez elkérhet&#337; ismer&#337;st&#337;l, esetleg t&#337;lünk kérik el a miénket. Mindkett&#337;
            illegális használatra ad lehet&#337;séget. Ezért a Windows XP-nél a Microsoft bevezette az
            aktiválást. Az aktiválás során egy program a számítógépben található fontosabb
            hardverekr&#337;l (például processzor, hálózati kártya, grafikus kártya, memória, stb.)
            készít egy egyedi azonosító sorozatot. A program a termékkulcsot és ezt az azonosító
            sorozatot felküldi a Microsoft szerverébe (személyes adatok a Microsoft információi
            szerint nem kerülnek felküldésre). Ott el&#337;ször is ellen&#337;rzésre kerül, hogy a termékkulcs
            benne van-e már az adatbázisban. Ha nincs, akkor letárolásra kerül a számítógépre
            jellemz&#337; egyedi azonosító sorozattal. Ha a termékkulcs már benne van az adatbázisban,
            akkor ott kell lennie mellette az azonosító sorozatnak is. A letárolt azonosítónak és a
            most felkerült azonosítónak meg kell egyeznie, vagy csak néhány hardver komponens
            esetében szabad eltérnie. Ha a kelleténél több eltérés van, akkor az arra utal, hogy
            másik gépre történt az installálás, és az lehet, hogy jogtalan volt. Ekkor sikertelen
            lesz az aktiválás. Lehet&#337;ség van korrigálni a Microsoft ügyfélszolgálatán telefonos
            kapcsolat keretében. Visszatérve az aktíváláshoz, válasszuk ki az els&#337; menüpontot
            (Activate Windows), majd a megjelen&#337; ablakban (16. ábra) adjuk meg a termékkulcsot, és
            válasszuk a Next gombot.</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/014-activate.jpg"> 
   
         </p><p>16.- ábra. Termékkulcs (Product Key) megadása</p><p></p><p>Az el&#337;bb elmondottak alapján egyértelm&#369;, hogy az aktiváláshoz él&#337; Internet kapcsolattal kell rendelkezni, vagyis a hálózat konfigurálását (IP cím, alhálózati maszk, alapértelmezett átjáró, DNS szerverek elérhet&#337;ségének megadása) az aktiválás el&#337;tt meg kell tenni. Ha minden rendben történt, akkor a 17. ábrának megfelel&#337; ablaknak kell megjelennie (Activation was successful).</p><p></p><p>
      
            <img src="./1.6. Az installálás lépései_files/015-activate.jpg"> 
   
         </p><p>17. ábra. Sikeres aktiválás</p><p></p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s05.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s07.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">1.5. 
     Az installálási el&#337;készületek&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;1.7. 
     Bejelentkezés, kijelentkezés, jelszómódosítás</td></tr></tbody></table></div></body></html>