
<!-- saved from url=(0051)https://gyires.inf.unideb.hu/KMITT/c09/ch01s07.html -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
      
   <title>1.7. Bejelentkezés, kijelentkezés, jelszómódosítás</title><link rel="stylesheet" href="./1.7. Bejelentkezés, kijelentkezés, jelszómódosítás_files/style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html" title="A Windows Server 2008 R2 menedzselése"><link rel="up" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html" title="1. fejezet - Elméleti háttér"><link rel="prev" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s06.html" title="1.6. Az installálás lépései"><link rel="next" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s08.html" title="1.8. Felhasználók, csoportok"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.7. 
     Bejelentkezés, kijelentkezés, jelszómódosítás</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s06.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">1. fejezet - Elméleti háttér</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s08.html">Következ&#337;</a></td></tr></tbody></table><hr></div><div class="sect1" title="1.7. Bejelentkezés, kijelentkezés, jelszómódosítás"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e467"></a>1.7. 
     Bejelentkezés, kijelentkezés, jelszómódosítás</h2></div></div></div><p>A számítógépen dolgozva használjuk annak er&#337;forrásait, és hálózaton keresztül pedig más
            gépekt&#337;l szolgáltatásokat elérve azok er&#337;forrásait is. Annak érdekében, hogy ez
            ellen&#337;rzötten történjen meg, a korszer&#369; operációs rendszerek a felhasználókat valamilyen
            azonosítási procedurának vetik alá. Az azonosítás módja igen sok féle lehet. Viszonylag
            elterjedtnek számít a név-jelszó (másnéven tudás-) alapú, a smartcard alapú, és a
            biometriai (ujjlenyomat, arcfelismerés) alapú. Ezek közül is a tudás alapú a
            legelterjedtebb. Biztonsági megfontolások miatt a cégek el&#337;írják, hogy adott
            id&#337;közönként a felhasználóknak cserélniük kell jelszavukat. A Windows-ra jellemz&#337;, hogy
            ugyanazt a tevékenységet (például jelszócserét) többféleképpen is el lehet végezni.
            Ilyen esetekben célszer&#369; a legkönnyebben használhatót választani. Jelen esetben (jelszó
            módosításhoz) a CTRL-ALT-DEL gombok egyidej&#369; megnyomásával induló alkalmazást érdemes
            választani. Az el&#337;z&#337; Windows verziókban ekkor a Security Dialog Box-nak nevezett
            alkalmazás indult el. A Windows Server 2008 R2 esetében a Security Options (18. ábra)
            jelenik meg. </p><div class="sect2" title="1.7.1. Security Options"><div class="titlepage"><div><div><h3 class="title"><a name="d0e472"></a>1.7.1. 
     Security Options</h3></div></div></div><p></p><p>
      
               <img src="./1.7. Bejelentkezés, kijelentkezés, jelszómódosítás_files/38-securityoptions.jpg"> 
   
            </p><p>18. ábra. Security Options</p><p></p><p>Ennek negyedik választási lehet&#337;sége a Change a password… Mivel el&#337;fordulhatna, hogy egy magára hagyott gépen a bejelentkezett felhasználó jelszavát valaki a felhasználó tudta nélkül így módosítaná, ezért el&#337;ször a régi jelszót kell megadni. Mivel ezt is, és az új jelszót is „vakon” kell megadni, és fennáll az elgépelés lehet&#337;sége, ezért az új jelszót kétszer kell megadni (19. ábra).</p><p>
      
               <img src="./1.7. Bejelentkezés, kijelentkezés, jelszómódosítás_files/39-changepassword.jpg"> 
   
            </p><p>19. ábra. Jelszó módosítás</p><p></p><p>Érdemes végig venni a Security Options többi szolgáltatását is. Els&#337; a Lock this computer. El&#337;fordulhat, hogy rövidebb-hosszabb id&#337;re magára kell hagyni a számítógépet, amelyen egy korábbi bejelentkezést követ&#337;en megkezdett munkák folynak (például olyan elindított alkalmazás, amelyek számol, dolgozik, és futása még nem fejez&#337;dött be). Ha a felhasználó ekkor kijelentkezik, akkor ezek a programok leállnak, futásuk megszakad, és az eddigi részeredmények elvesznek. Ha viszont a számítógépet felügyelet nélkül bejelentkezve magára hagyják, akkor egy másik felhasználó visszaélhet vele (például e-mail-eket küldhet a nevében, elolvassa dokumentumait, stb.). Ennek kiküszöbölésére vezették be a zárolási lehet&#337;séget (Lock). Zárolás alatt az alkalmazások futnak tovább. A zárolás feloldása után a felhasználó is tovább dolgozhat a gépen. Korábbi Windows verziókban, ha a zárolást a rendszergazda oldotta fel, akkor a bejelentkezett felhasználó alkalmazásai abortálódtak, és az el nem mentett adatok elvesztek.</p><p>A második lehet&#337;ség a Switch User. Szintén el&#337;fordulhat, hogy bár épp valaki be van jelentkezve a számítógépen, de rövid id&#337;re valaki másnak is szüksége volna rá. Ugyanakkor a bejelentkezett felhasználó elindított alkalmazásai még futnak. Kijelentkezés esetén az alkalmazások futása megszakadna. Ennek megoldására vezették be felhasználóváltást. A zároláshoz hasonlóan az alkalmazások futnak tovább, és lehet&#337;ség van egy új felhasználó bejelentkezésére. Annak megtörténte után az újonnan bejelentkezett felhasználó dolgozhat, programokat indíthat. Munkája végeztével kijelentkezhet. Ezután az els&#337;nek bejelentkezett felhasználó (a zároláshoz hasonlóan) visszajelentkezhet.</p><p>A harmadik lehet&#337;ség (Log off) tulajdonképpen már szóba került. A felhasználó ezzel jelentkezik ki, és egy másik felhasználó pedig bejelentkezhet. Alkalmazásai bezáródnak, el nem mentett adatai elvesznek. Az operációs rendszer ugyan detektálja ezt (alkalmazástól függ&#337;en), és jelzi is, de a felhasználó kikényszerítheti a kilépést (Force).</p><p>A negyedik lehet&#337;ség már tisztázásra került (jelszó módosítás).</p><p>Az ötödik (utolsó) lehet&#337;ség segítségével (Start Task Manager) egy olyan 6 füllel rendelkez&#337; alkalmazás indítható el, amellyel megnézhet&#337;: </p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>milyen programokat futtat a felhasználó (Applications), </p></li><li class="listitem"><p>milyen futó folyamatok vannak (Processes), </p></li><li class="listitem"><p>a szolgáltatások közül (Services) melyek milyen állapotban vannak (Stopped, Running), </p></li><li class="listitem"><p>grafikus felületen ellen&#337;rizhet&#337; a processzor és a memória terheltség (Performance),</p></li><li class="listitem"><p>ellen&#337;rizhet&#337; a hálózatra használható kártyák (Bluetooth, Wired és Wireless) forgalma, </p></li><li class="listitem"><p>és végül a bejelentkezett felhasználók (Users).</p></li></ol></div><p>Bár sokat fejl&#337;dött a Task Manager, azért jó tudni, hogy vannak olyan hasonló célt szolgáló (akár ingyenes) alkalmazások, amelyek ennél több információt szolgáltatnak. Az egyik leginkább elterjedt program a Sysinternals cég (<a class="ulink" href="http://www.sysinternals.com/" target="_top">http://www.sysinternals.com</a>) által készített Process Explorer. (Az oldal 2006 óta a Microsoft Technet oldalán keresztül érhet&#337; el: <a class="ulink" href="http://technet.microsoft.com/en-us/sysinternals/bb896653" target="_top">http://technet.microsoft.com/en-us/sysinternals/bb896653</a>).</p></div><div class="sect2" title="1.7.2. Leállítás (shutdown)"><div class="titlepage"><div><div><h3 class="title"><a name="d0e529"></a>1.7.2. 
      Leállítás (shutdown)</h3></div></div></div><p>Bár nem itt érhet&#337; el, de meg kell említeni a Shutdown (leállítás) menüpontot. Sok felhasználó a munkaid&#337; végén számítógépét nem állítja le, hanem egyszer&#369;en kikapcsolja. Bár ez nem szabályszer&#369;, mégis egyes esetekben nem okoz problémát, máskor pedig igen. Ennek oka az, hogy az operációs rendszer sok adatot, változást a memóriában &#337;riz. Például az alkalmazások futásakor létrehozott információt is, mint egy Word esetében a dokumentumot magát. Amikor a felhasználó elmenti a dokumentumot, akkor az operációs rendszer amennyiben a késleltetett írás be van kapcsolva, akkor nem menti el az adatokat rögtön (bár azt jelzi vissza), hanem csak kés&#337;bb, amikor a felhasználó épp nem végez munkát a számítógépen. Ha a mentést követ&#337;en a felhasználó egyszer&#369;en kikapcsolja a számítógépet, akkor azok az adatai, amelyekr&#337;l azt hiszi, hogy el vannak mentve (de adott esetben még sem), elvesz(het)nek. Shutdown esetében az operációs rendszer ezeket az el nem végzett mentéseket befejezi. Annak függvényében, hogy mennyi el nem mentett adat van, a shutdown folyamat viszonylag hosszabb ideig is tarthat. Érdemes kivárni.</p><p></p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s06.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s08.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">1.6. 
     Az installálás lépései&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;1.8. 
      Felhasználók, csoportok</td></tr></tbody></table></div></body></html>