
<!-- saved from url=(0051)https://gyires.inf.unideb.hu/KMITT/c09/ch01s09.html -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
      
   <title>1.9. Tartományvezérl&#337; létrehozása</title><link rel="stylesheet" href="./1.9. Tartományvezérl&#337; létrehozása_files/style.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.75.2"><link rel="home" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html" title="A Windows Server 2008 R2 menedzselése"><link rel="up" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html" title="1. fejezet - Elméleti háttér"><link rel="prev" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s08.html" title="1.8. Felhasználók, csoportok"><link rel="next" href="https://gyires.inf.unideb.hu/KMITT/c09/ch02.html" title="2. fejezet - Gyakorlatok"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tbody><tr><th colspan="3" align="center">1.9. 
      Tartományvezérl&#337; létrehozása</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s08.html">El&#337;z&#337;</a>&nbsp;</td><th width="60%" align="center">1. fejezet - Elméleti háttér</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch02.html">Következ&#337;</a></td></tr></tbody></table><hr></div><div class="sect1" title="1.9. Tartományvezérl&#337; létrehozása"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e777"></a>1.9. 
      Tartományvezérl&#337; létrehozása</h2></div></div></div><p></p><p>Az eddig ismertetésre került elméleti részek mindenhol tartományi logikai modellre épültek. A következ&#337;kben ábrák segítségével bemutatásra kerül egy tartományvezérl&#337; létrehozása. Els&#337; lépésként el kell indítani a Szerver menedzsert (Server Manager) (30. ábra).</p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/18-servermanager.jpg"> 
   
         </p><p>30. ábra. A Server Manager indítása, és a Server Roles kiválasztása</p><p></p><p>A megjelen&#337; ablakban ki kell választani a Server Roles (szerver szerepkör) menüt, majd megjelölni az Active Directory Domain Services-t. A szerepkör betöltéséhez szükség van a .NET Framework telepítésére is. Ezt a Server Manager automatikusan felismeri, és jelzi, csak el kell fogadni az Add Required Features segítségével (31. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/19-ads.jpg"> 
   
         </p><p>31. ábra. A .NET Framework-re szükség van</p><p></p><p>A következ&#337; ablakban az installáló program összefoglalja, milyen komponensek kerülnek telepítésre. Folytatás az Install gomb-bal történik (32. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/20-ads.jpg"> 
   
         </p><p>32. ábra. Ezek a komponensek kerülnek telepítésre</p><p></p><p>A számítógép és a diszk sebességét&#337;l függ&#337;en viszonylag hosszabb id&#337; után megtörténik a komponensek hozzáadása (33. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/21-ads.jpg"> 
   
         </p><p>33. ábra. Sikeresen megtörtént a komponensek hozzáadása</p><p></p><p>Ekkor azonban még nincs tartományvezérl&#337;, ehhez szükség van a dcpromo program futtatására is (34. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/22-ads.jpg"> 
   
         </p><p>34. ábra. A dcpromo-t még futtatni kell</p><p></p><p>Parancssorból elindítva a dcpromo-t, elindul egy (a Windows világra jellemz&#337;) „varázsló”
            &nbsp;(wizard) (35. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/23-dcpomo.jpg"> 
   
         </p><p>35. ábra. A dcpromo futtatásakor induló varázsló (wizard)</p><p></p><p>Els&#337; lépésként meg kell adni, létezik-e már az a tartomány, amelynek ez a számítógép a tartományvezérl&#337;je lesz (ha igen: Existing forest, ha nem: Create a new domain in a new forest) (36. ábra). Jelen esetben nem létezik.</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/24-dcpomo.jpg"> 
   
         </p><p>36. ábra. Új tartomány létrehozása</p><p></p><p>Kés&#337;bb ütközések elkerülése érdekében ellen&#337;rzésre kerül, tényleg nem létezik-e a tartomány (37. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/25-dcpomo.jpg"> 
   
         </p><p>37. ábra. A tartomány meglétének ellen&#337;rzési folyamata</p><p></p><p>Amennyiben valóban nem létezik még a tartomány, akkor a következ&#337; lépésben meg kell adni, milyen szolgáltatásokkal rendelkezzen a tartományvezérl&#337;. Amennyiben korábbi verziójú operációs rendszerre is számítani kell a tartomány m&#369;ködése során, akkor nem olyan m&#369;ködési szintet kell választani, amit az képes kezelni. Jelen esetben a legmagasabbat lehet választani, a Windows Server 2008 R2-&#337;t (38. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/26-dcpomo.jpg"> 
   
         </p><p>38. ábra. A tartomány m&#369;ködési szintjének megadása</p><p></p><p>A Windows 2000-t&#337;l kezd&#337;d&#337;en jelent meg az Active Directory, melynek m&#369;ködése a DNS-re épül. Ezért a tartományban, valamelyik tartományvezérl&#337;n lennie kell egy DNS szervernek. Ennek meglétét a telepít&#337; ellen&#337;rzi (39. ábra).</p><p></p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/27-dcpomo.jpg"> 
   
         </p><p>39. ábra. DNS szerver meglétének ellen&#337;rzése</p><p></p><p>Ha nincs, akkor automatikusan megtörténik a DNS szerver létrehozása (40. ábra).</p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/28-dcpomo.jpg"> 
   
         </p><p>40. ábra. A DNS szerver telepítése</p><p></p><p>A DNS szerver telepítése után folyatódik a tartományvezérl&#337; létrehozásához szükséges adatok megadása. Az Active Directory valójában egy adatbázis. Következ&#337;ként meg kell adni, hogy melyik mappában legyen, hol tárolódjanak a log fájlok, és melyik legyen a SYSVOL mappa. A telepít&#337; erre felkínál egy alapértelmezés szerinti mappát, érdemes azt választani (41. ábra).</p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/29-dcpomo.jpg"> 
   
         </p><p>41. ábra. Az Active Directory tároló mappáinak megadása</p><p></p><p>Minden szükséges adat megadásra került. A következ&#337; ablakban ezek kerülnek összefoglalásra. Ha minden rendben, kezd&#337;dhet a tartományvezérl&#337; létrehozása a Next megnyomásával (42. ábra).</p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/30-dcpomo.jpg"> 
   
         </p><p>42. ábra. Az eddig megadott adatok összefoglalása</p><p></p><p>Ezután megkezd&#337;dik a tartomány létrehozása, a tartományvezérl&#337; kialakítása, és a szükséges vezérl&#337;programok hozzáadása (43. ábra).</p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/31-dcpomo.jpg"> 
   
         </p><p>43. ábra. Megkezd&#337;dött a tartomány létrehozása, a tartományvezérl&#337; kialakítása</p><p></p><p>Célszer&#369; a végén a számítógépet újraindítani. Ezután lehet ellen&#337;rizni, felkerültek-e a szükséges vezérl&#337; program (például Active Directory Domains and Trust, Active Directory Sites and Services, Active Directory Users and Computers, stb.) (44. ábra).</p><p>
      
            <img src="./1.9. Tartományvezérl&#337; létrehozása_files/32-adusersandcomputers.jpg"> 
   
         </p><p>44. ábra. A menürendszer kiegészült új programokkal</p><p></p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tbody><tr><td width="40%" align="left"><a accesskey="p" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01s08.html">El&#337;z&#337;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="https://gyires.inf.unideb.hu/KMITT/c09/ch01.html">Fel</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="https://gyires.inf.unideb.hu/KMITT/c09/ch02.html">Következ&#337;</a></td></tr><tr><td width="40%" align="left" valign="top">1.8. 
      Felhasználók, csoportok&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="https://gyires.inf.unideb.hu/KMITT/c09/index.html">Tartalom</a></td><td width="40%" align="right" valign="top">&nbsp;2. fejezet - Gyakorlatok</td></tr></tbody></table></div></body></html>